ErpTest/src/Catalogs/уатПланыПримененияЗатрат/уатПланыПримененияЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПланыПримененияЗатрат</name>
  <comment>(уат)</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>ВидЗатрат</name>
      <type>
        <types>EnumRef.уатВидыЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Фильтры</name>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
        <types>String</types>
        <types>CatalogRef.уатКолонны</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Catalogs/уатПланыПримененияЗатрат/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	//уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Об, Отказ, СтандартнаяОбработка, ЭтаФорма, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.ЗатратыПодразделение, "Объект.Организация");
	
	// УправлениеПредприятием.СлужебныеПодсистемы
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Конец УправлениеПредприятием.СлужебныеПодсистемы
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Фильтры.ПодчиненныеЭлементы.ФильтрыФильтр.ВыбиратьТип = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Фильтры

&НаКлиенте
Процедура ФильтрыФильтрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	                                              
	ТекТС = Элементы.Фильтры.ТекущиеДанные.Фильтр;
	
	Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ТекТС) Тогда
		СтандартнаяОбработка = Ложь;
		
		мСписок = Новый СписокЗначений;
		мСписок.Добавить(1, "Колонны");
		мСписок.Добавить(2, "Транспортное средство");
		мСписок.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ФильтрыФильтрНачалоВыбораЗавершение", ЭтотОбъект,
			Новый Структура("ТекТС, Элемент", ТекТС, Элемент)));
        
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// УправлениеПредприятием.СлужебныеПодсистемы
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец УправлениеПредприятием.СлужебныеПодсистемы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ФильтрыФильтрНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Перем СтандартнаяОбработка;
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
		
	ИначеЕсли ВыбранныйЭлемент.Значение = 1 Тогда
		ОткрытьФорму("Справочник.уатКолонны.ФормаВыбора",, ДополнительныеПараметры.Элемент);
		
	ИначеЕсли ВыбранныйЭлемент.Значение = 2 Тогда
		СтруктураОтбора = Новый Структура;
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			СтруктураОтбора.Вставить("уатОрганизация", Объект.Организация);
		КонецЕсли;
		
		уатИнтерфейсВводаТС.НомерТСНачалоВыбора(ДополнительныеПараметры.Элемент, ДополнительныеПараметры.ТекТС,
			СтруктураОтбора, СтандартнаяОбработка);
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
